# Напишите программу, которая выводит фразу «Я стану крутым программистом!» три раза на отдельных строках; строки должны
# быть именно такие, символ в символ!.
#
# Для удобства советую поместить эту фразу в переменную и затем использовать ее при выводе.
#
# Sample Input:
#
# Sample Output:
#
# Я стану крутым программистом!
# Я стану крутым программистом!
# Я стану крутым программистом!

# text = 'Я стану программистом!\n'
# print(text * 3)

# Напишите программу, которая напечатает строку, состоящую из 777 букв "W"

print(777 * 'W')